# 道姑朋友
source = {}

# 一分钟80拍
source["bpm"] = 80

# beat_n一个小节有n拍，
source["beat_n"] = 4

# beat_m分音符为一拍
source["beat_m"] = 4
    

# rc:唱名,音高  note:代表时值，如4分音符，8分音符
# 第一小节
chapterA = [
    #繁华声遁入空门折煞了世人
    ['E',8],
    ['-',4],
    ['E',8],
    ['T',8],
    ['-',16],
    ['Y',8],
    ['T',8],
    ['-',16],
    ['Y',8],
    ['1',8],
    ['-',4],
    ['U',8],
    ['Y',8],
    ['-',16],
    ['T',8],
    ['Y',16],
    ['E',8],

    #梦偏冷辗转一生情债又几本
    ['E',8],
    ['-',4],
    ['E',8],
    ['T',8],
    ['-',16],
    ['Y',8],
    ['T',8],
    ['-',16],
    ['Y',8],
    ['1',8],
    ['U',8],
    ['Y',8],
    ['Y',4],
    ['E',4],
    ['W',4],

    #如你默认
    ['Y',8],
    ['2',4],
    ['Y',8],
    ['2',4],

    #死生枯等
    ['Y',8],
    ['2',4],
    ['Y',16],
    ['U',4],
    ['E',4],

    #枯等一圈
    ['W',8],
    ['E',8],
    ['W',8],
    ['T',4],

    #又一圈的年轮
    #浮屠塔断了几层断了谁的魂
    #痛直奔一盏残灯倾塌的山门
    #容我再等
    #历史转身
    #等酒香醇等你弹一曲古筝
    #雨纷纷旧故里草木深
    #我听闻你始终一个人
    #斑驳的城门盘踞着老树根
    #石板上回荡着是再等
    #缘分落地生根是我们
    #迦蓝寺听雨声盼永恒

]